import { IHolidays } from '../@types/holidays';

export const MIN_YEAR = 1900;
export const MAX_YEAR = 2099;

export const HOLIDAYS: IHolidays = {
  0: {
    1: 'Новый год',
    7: 'Рождество Христово (православное Рождество)',
  },

  2: {
    8: 'День женщин',
  },

  4: {
    1: 'Праздник труда',
    9: 'День Победы',
  },

  6: {
    3: 'День Независимости Республики Беларусь',
  },

  10: {
    7: 'День Октябрьской революции',
  },

  11: {
    25: 'Рождество Христово (католическое Рождество)',
  },
};
